ut/src/InformationRegisters/ДокументыОПредстоящейПоставке/ДокументыОПредстоящейПоставке.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ДокументыОПредстоящейПоставке</name>
  <resources>
    <name>СуммаНалога</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>16</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Состояние</name>
    <type>
      <types>EnumRef.СостояниеДОПП</types>
    </type>
  </attributes>
  <attributes>
    <name>ПланируемаяДатаВвоза</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КатегорияПодакцизногоТовара</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаСобытия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>КБК</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>НомерДОПП</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>13</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ut/src/InformationRegisters/ДокументыОПредстоящейПоставке/Forms/РабочееМесто/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Организация    = Параметры.Организация;
	Период         = ТекущаяДатаСеанса();
	СуммаДокумента = Параметры.СуммаДокумента;
	НомерДОПП      = Параметры.НомерДОПП;
	
	Если Параметры.НеВыводитьЗаголовок Тогда
		Элементы.Организация.Видимость = Ложь;
		Элементы.СписокДОПП.КоманднаяПанель.Видимость = Ложь;
		Элементы.СписокДОППКонтрагент.Видимость = Ложь;
		Элементы.СписокДОПППланируемаяДатаВвоза.Видимость = Ложь;
		Элементы.СписокДОППКомментарий.Видимость = Ложь;
		Элементы.ПоказатьДОППКОбработке.Видимость = Ложь;
		Элементы.СписокДОПП.КонтекстноеМеню.ПодчиненныеЭлементы.СписокДОППКонтекстноеМенюСоздать.Видимость = Ложь;
		Элементы.СписокДОПП.КонтекстноеМеню.ПодчиненныеЭлементы.СписокДОППКонтекстноеМенюУдалить.Видимость = Ложь;
		ПересчитатьСуммовыеПоказатели();
	Иначе
		Элементы.ГруппаДанныеИЗДОПП.Видимость = Ложь;
		КодБКНДСВидНалога = "";
		КодБКНДС = РегистрыСведений.ДокументыОПредстоящейПоставке.УточнитьКБК(КодБКНДСВидНалога);
		КодыБК.Загрузить(РегистрыСведений.ДокументыОПредстоящейПоставке.ПолучитьКодыБК(КодБКНДС));
		КБКПоКатегориям.Загрузить(РегистрыСведений.ДокументыОПредстоящейПоставке.ПолучитьКБКПоКатегориямТоваров());
	КонецЕсли;
	
	ОбщегоНазначенияУТ.ОбработкаЗаполнения(ЭтотОбъект, Новый Структура, СтандартнаяОбработка);
	
	СписокДОПП.Параметры.УстановитьЗначениеПараметра("Организация", Организация);
	
	УстановитьУсловноеОформление();
		
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ИзмененияПоДОПП" Тогда
		
		Элементы.СписокДОПП.Обновить();
		Если СуммаДокумента <> 0 Тогда
			ПересчитатьСуммовыеПоказатели();
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура УстановитьСостояние(Команда)
	
	ТекущиеДанные = Элементы.СписокДОПП.ТекущиеДанные;

	Если ТекущиеДанные = Неопределено Тогда
		ОчиститьСообщения();
		ТекстСообщения = НСтр("ru='Не выбран документ о предстоящей поставке'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
		Возврат;
	КонецЕсли;
	
	// Получаем массив идентификаторов выделенных строк
	МассивИД = Элементы.СписокДОПП.ВыделенныеСтроки;
	МассивВыделенныхСтрок = Новый Массив();
	// Обходим массив и получаем данные по каждому идентификатору
	Для Каждого Идентификатор Из МассивИД Цикл
		ДанныеСтроки = Элементы.СписокДОПП.ДанныеСтроки(Идентификатор);
		// Обязательно проверяем на Неопределено (данные могут быть не загружены в кэш)
		Если ДанныеСтроки <> Неопределено Тогда
			МассивВыделенныхСтрок.Добавить(ДанныеСтроки)
		КонецЕсли;
	КонецЦикла;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Организация", Организация);
	ПараметрыФормы.Вставить("Состояние",   ТекущиеДанные.Состояние);
	
	ДатаСобытия = ?(ЗначениеЗаполнено(ТекущиеДанные.ДатаСобытия), ТекущиеДанные.ДатаСобытия, Период);
	ПараметрыФормы.Вставить("ДатаСобытия", ДатаСобытия);
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ВыборСостоянияЗавершение", ЭтотОбъект, МассивВыделенныхСтрок);
	ОткрытьФорму("РегистрСведений.ДокументыОПредстоящейПоставке.Форма.УстановкаСостоянияДОПП",
				ПараметрыФормы,
				ЭтотОбъект,
				"УстановкаСостояние",
				,,
				ОписаниеОповещения,
				РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьДОППКОбработке(Команда)
	
	ПоказатьДОППКОбработкеКлиент();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	
	СписокДОПП.Параметры.УстановитьЗначениеПараметра("Организация", Организация);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписокДОПП

&НаКлиенте
Процедура СписокДОПППередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Если Копирование Тогда
		Возврат;
	КонецЕсли;

	Отказ = Истина; // Прерываем стандартный процесс создания нового элемента
	
	КодыБКМассив = Новый Массив();
	Для Каждого КБК Из КодыБК Цикл
		СтруктураСтроки = Новый Структура();
		СтруктураСтроки.Вставить("Код",      КБК.Код);
		СтруктураСтроки.Вставить("Название", КБК.Название);
		КодыБКМассив.Добавить(СтруктураСтроки);
	КонецЦикла;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Организация", Организация);
	ПараметрыФормы.Вставить("КодыБК",      КодыБКМассив);
	ПараметрыФормы.Вставить("КодБКНДС",     КодБКНДС);
		
	ОткрытьФорму("РегистрСведений.ДокументыОПредстоящейПоставке.Форма.ФормаЗаписи", ПараметрыФормы, Элемент);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ПоказатьДОППКОбработкеКлиент()
	
	Если ДОППКОбработке Тогда
		ЗаголовокТекст = НСтр("ru = 'Ожидается поставка'");
		ПолеОтбора = Новый ПолеКомпоновкиДанных("Состояние");
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
			СписокДОПП,
			ПолеОтбора,
			,
			,
			,
			Ложь);
	Иначе
		ЗаголовокТекст = НСтр("ru = 'Все документы'");
		ПолеОтбора = Новый ПолеКомпоновкиДанных("Состояние");
		ЗначениеОтбора = ПредопределенноеЗначение("Перечисление.СостояниеДОПП.ПустаяСсылка");
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
			СписокДОПП,
			ПолеОтбора,
			ЗначениеОтбора,
			ВидСравненияКомпоновкиДанных.Равно,
			,
			Истина);
	КонецЕсли;
	
	Элементы.ПоказатьДОППКОбработке.Заголовок = ЗаголовокТекст;
	ДОППКОбработке = Не ДОППКОбработке;
	
КонецПроцедуры

&НаСервере
Процедура ПересчитатьСуммовыеПоказатели()
	
	СуммаПринятаяКУчету = 0;
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	СУММА(ДокументыОПредстоящейПоставке.СуммаНалога) КАК СуммаНалога
	|ИЗ
	|	РегистрСведений.ДокументыОПредстоящейПоставке КАК ДокументыОПредстоящейПоставке
	|ГДЕ
	|	ДокументыОПредстоящейПоставке.Организация = &Организация
	|	И ДокументыОПредстоящейПоставке.НомерДОПП = &НомерДОПП
	|	И ДокументыОПредстоящейПоставке.Состояние <> ЗНАЧЕНИЕ(Перечисление.СостояниеДОПП.ПустаяСсылка)";
	
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("НомерДОПП",   НомерДОПП);
	Результат = Запрос.Выполнить().Выбрать();
	Если Результат.Следующий() Тогда
		СуммаПринятаяКУчету = Результат.СуммаНалога;
	КонецЕсли;
	СуммаОсталосьПринять = СуммаДокумента - СуммаПринятаяКУчету;
	
КонецПроцедуры

&НаСервере
Процедура СохранитьИзменения(МассивСтрок, НовыеЗначения)
	
	МетаданныеРегистра    = Метаданные.РегистрыСведений.ДокументыОПредстоящейПоставке;
	ПолноеИмяРегистра     = МетаданныеРегистра.ПолноеИмя();
	
	Для Каждого Строка Из МассивСтрок Цикл
		
		НачатьТранзакцию();
		Попытка
			
			Блокировка = Новый БлокировкаДанных;
			ЭлементБлокировки = Блокировка.Добавить(ПолноеИмяРегистра);
			ЭлементБлокировки.УстановитьЗначение("Организация", НовыеЗначения.Организация);
			ЭлементБлокировки.УстановитьЗначение("НомерДОПП",   Строка.НомерДОПП);
			Блокировка.Заблокировать();
			
			НаборЗаписей = РегистрыСведений.ДокументыОПредстоящейПоставке.СоздатьНаборЗаписей();
			НаборЗаписей.Заполнить(Неопределено);
			НаборЗаписей.Отбор.Организация.Установить(НовыеЗначения.Организация);
			НаборЗаписей.Отбор.НомерДОПП.Установить(Строка.НомерДОПП);
			НаборЗаписей.Отбор.КБК.Установить(Строка.КБК);
			НаборЗаписей.Отбор.ДатаСобытия.Установить(Строка.ДатаСобытия);
			
			НаборЗаписей.Записать();
			
			НаборЗаписей = РегистрыСведений.ДокументыОПредстоящейПоставке.СоздатьНаборЗаписей();
			НаборЗаписей.Заполнить(Неопределено);
			НаборЗаписей.Отбор.Организация.Установить(НовыеЗначения.Организация);
			НаборЗаписей.Отбор.НомерДОПП.Установить(Строка.НомерДОПП);
			НаборЗаписей.Отбор.КБК.Установить(Строка.КБК);
			НаборЗаписей.Отбор.ДатаСобытия.Установить(НовыеЗначения.ДатаСобытия);
			
			НоваяЗапись = НаборЗаписей.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяЗапись, Строка);
			ЗаполнитьЗначенияСвойств(НоваяЗапись, НовыеЗначения);
			
			НаборЗаписей.Записать();
			
			ЗафиксироватьТранзакцию();
				
		Исключение
				
			ОтменитьТранзакцию();
				
			ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Не удалось записать изменения по ДОПП №%1 по причине:
				|%2'"), Строка.НомерДОПП, ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
				
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
				
		КонецПопытки;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыборСостоянияЗавершение(РезультатВыбора, ДопПараметры) Экспорт
	
	Если РезультатВыбора = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СохранитьИзменения(ДопПараметры, РезультатВыбора);
	
	Элементы.СписокДОПП.Обновить();
	
	Оповестить("Запись_РегистрДокументыОПредстоящейПоставке", НомерДОПП);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформление()
	
	УсловноеОформление.Элементы.Очистить();
	
	Элемент = УсловноеОформление.Элементы.Добавить();

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.СписокДОППСостояние.Имя);

	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("СписокДОПП.Состояние");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.НеЗаполнено;
	Элемент.Оформление.УстановитьЗначениеПараметра("Текст", НСтр("ru = 'Поставка ожидается'"));

	ОтборЭлемента.Использование = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузкаЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Результат.Статус = "Ошибка" Тогда
		СтандартныеПодсистемыКлиент.ВывестиИнформациюОбОшибке(Результат.ИнформацияОбОшибке);
		Возврат;
	КонецЕсли;
	
	ОбновитьФорму = ПолучитьИзВременногоХранилища(Результат.АдресРезультата);
	УдалитьИзВременногоХранилища(Результат.АдресРезультата);
	
	Если ОбновитьФорму Тогда
		Элементы.СписокДОПП.Обновить();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
